Revit 2024 API
ScheduleHorizontalAlignment Enumeration
 Horizontal alignment of data in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum ScheduleHorizontalAlignment
Visual Basic
Public Enumeration ScheduleHorizontalAlignment
Visual C++
public enum class ScheduleHorizontalAlignment
Members
Member name | Description
Left |  Left aligned
Center |  Center aligned
Right |  Right aligned
See Also
Autodesk.Revit.DB Namespace